{
    "pagetitle": "Our Training Services",
    "pagelead1": "We deliver training that is based on improving the way testers see, think, interact with others and with the system under test. This is one way to show our value-add as testers. We are community focused liaising with like-minded, free thinking testers and take the opportunity to present at conferences and SIGsT groups.",
    "pagelead2": "Brian founded the Kiwi Workshop on Software Testing (KWST), an invite-only peer conference with 17 New Zealand test leaders facilitated with help and guidance from James Bach.",
    "courses": [
    { "id": "course-fundamentals" 
    , "title": "Test Fundamentals"
    , "duration": "2 days"
    , "content": "Fundamental Software Testing focuses on building the thinking and questioning skills of a tester. We show how to take a critical approach to testing with an emphasis on structured exploratory testing."
    , "objectives":
        [ "What is testing?"
        , "The different software development life-cycles and how testing fits in"
        , "Agile - what is it and how does testing fit?"
        , "Test approach, analysis and design"
        , "Test management" ]
    } ,
    { "id": "course-agile-test" 
    , "title": "Agile Testing"
    , "duration": "2 days"
    , "content": "Agile development methods have radically changed the approach to the software development lifecycle, but where does it leave the tester?"
    , "objectives": 
        [ "An introduction to agile and what is agile?"
        , "Testing in an agile context"
        , "How to adapt to agile"
        , "Test planning in an agile context"
        , "Test analysis and design in an agile context"
        , "Stories, acceptance criteria and how testing deals with these" ]}
    ,
    { "id": "course-explore-test" 
    , "title": "Exploratory Testing"
    , "duration": "1 day"
    , "content": "Exploratory Testing is a focused introduction to effective, practical exploratory testing.This is a hands on course that uses various heuristics and approaches to help testers become better testers."
    , "objectives": 
        [ "Lean approach to software testing"
        , "Understanding and using heuristics and oracles"
        , "How bias affects our test effort"
        , "Using maps and tours"
        , "Employing effective testing Strategies"
        , "Becoming a better skilled tester" ]}
    ,
    { "id": "course-explore-mgmt" 
    , "title": "Exploratory Test Management"
    , "duration": "1 day"
    , "content": "Exploratory Test Management teaches testers how to apply an effective management framework over the top of your exploratory testing using session and thread based test management."
    , "objectives":                 
        [ "Lean test management"
        , "Using mind-maps"
        , "Session based test management including the use of charters"
        , "Deriving reporting metrics to help tell the testing story"
        , "Thread based test management"
        , "How to tell an effective testing story" ]
    } , 
    { "id": "course-test-leadership" 
    , "title": "Test Leadership"
    , "duration": "1 day"
    , "content": "Test Leadership course helps the aspiring test leaders, test managers or test directors understand the principles of leadership, ethics, motivation as well as practical test management."
    , "objectives":
        [ "What is leadership?"
        , "Principles and types of leadership"
        , "Ethics"
        , "Motivating test teams"
        , "Test management and how to become a leader"
        , "Coaching and mentoring"
        , "Building teams"
        , "Building communities" ]}
]}